app/views/st_score/home.html.erb

        </tr>
    <%@student.score.each do |s|%>
---
SELECT "scores".* FROM "scores" WHERE "scores"."student_id" = ?  [["student_id", 1]]